In [31]:
import pandas as pd
import numpy as np
import sqlite3

In [32]:
titanic_df = pd.read_csv(r"/Users/abhiramsingireddy/.cache/kagglehub/datasets/brendan45774/test-file/versions/6/tested.csv")

In [33]:
titanic_df = titanic_df.set_index("PassengerId")

In [34]:
titanic_df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [35]:
# creating the db... connecting to a db that doesn't exist creates and connects
conn = sqlite3.connect('titanic.db')

In [36]:
# migrates dataframe to the db, Replaces if exists already
titanic_df.to_sql('tbl_titanic', con=conn, if_exists='replace')

418

In [40]:
test_sql = """
    SELECT
        PassengerID,
        Survived,
        Pclass,
        Name,
        Age,
        Fare
FROM tbl_titanic
WHERE
    Pclass in (1,2)
"""

In [42]:
sql_df = pd.read_sql(test_sql, con=conn)

sql_df

,PassengerId,Survived,Pclass,Name,Age,Fare
0,894,0,2,"Myles, Mr. Thomas Francis",62.0,9.6875
1,899,0,2,"Caldwell, Mr. Albert Francis",26.0,29.0000
2,903,0,1,"Jones, Mr. Charles Cresson",46.0,26.0000
3,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",23.0,82.2667
4,905,0,2,"Howard, Mr. Benjamin",63.0,26.0000
...,...,...,...,...,...,...
195,1297,0,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",20.0,13.8625
196,1298,0,2,"Ware, Mr. William Jeffery",23.0,10.5000
197,1299,0,1,"Widener, Mr. George Dunton",50.0,211.5000
198,1303,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",37.0,90.0000
199,1306,1,1,"Oliva y Ocana, Dona. Fermina",39.0,108.9000

In [44]:
sql_string = """
Select
    Pclass,
    case
        when Age < 18 then 'child'
        else 'adult'
    and as age_group,
    cast(Avg(Avg) as integer) as average_age
from tbl_titanic
where Embarked = 'C'
group by
"""